In [55]:
import pandas as pd

In [56]:
df = pd.read_excel('tabela_6794.xlsx')

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Região  6 non-null      object
 1   2016    6 non-null      int64
 2   2017    6 non-null      int64
 3   2018    6 non-null      int64
 4   2019    6 non-null      int64
 5   2021    6 non-null      int64
 6   2022    6 non-null      int64
 7   2023    6 non-null      int64
dtypes: int64(7), object(1)
memory usage: 516.0+ bytes

In [58]:
df.head()

     Região    2016    2017    2018    2019    2021    2022    2023
0    Brasil  150113  152497  154681  156556  160121  161694  163396
1     Norte   11571   11941   12239   12480   13011   13170   13418
2  Nordeste   39714   40243   40742   41274   42100   42571   42951
3   Sudeste   65431   66314   67199   67984   69510   69989   70503
4       Sul   22089   22429   22739   22917   23333   23527   23753

In [59]:
df['2016'] = df['2016'].apply(lambda x: x*1000)
df['2017'] = df['2017'].apply(lambda x: x*1000)
df['2018'] = df['2018'].apply(lambda x: x*1000)
df['2019'] = df['2019'].apply(lambda x: x*1000)
df['2021'] = df['2021'].apply(lambda x: x*1000)
df['2022'] = df['2022'].apply(lambda x: x*1000)
df['2023'] = df['2023'].apply(lambda x: x*1000)

In [60]:
df.head(10)

,Região,2016,2017,2018,2019,2021,2022,2023
0,Brasil,150113000,152497000,154681000,156556000,160121000,161694000,163396000
1,Norte,11571000,11941000,12239000,12480000,13011000,13170000,13418000
2,Nordeste,39714000,40243000,40742000,41274000,42100000,42571000,42951000
3,Sudeste,65431000,66314000,67199000,67984000,69510000,69989000,70503000
4,Sul,22089000,22429000,22739000,22917000,23333000,23527000,23753000
5,Centro-Oeste,11311000,11566000,11760000,11901000,12166000,12439000,12769000

In [61]:
df = df.melt(
    id_vars='Região',
    value_vars=['2016', '2017', '2018', '2019', '2021', '2022', '2023'],
    var_name='Ano',
    value_name='Quantidade'
)

In [62]:
df.head(10)

         Região   Ano  Quantidade
0        Brasil  2016   150113000
1         Norte  2016    11571000
2      Nordeste  2016    39714000
3       Sudeste  2016    65431000
4           Sul  2016    22089000
5  Centro-Oeste  2016    11311000
6        Brasil  2017   152497000
7         Norte  2017    11941000
8      Nordeste  2017    40243000
9       Sudeste  2017    66314000

In [63]:
df.to_csv('tabela_6974.csv')